[
  {
    "role": "UX Engineer",
    "company": "American Express",
    "location": "London",
    "date": "2019 - Present",
    "desc": "Currently creating the future of the ‘refer a friend’ experience.",
    "longDesc": [
      "UX designer and Front-end developer building the future of the 'Refer a Friend' scheme in a research and development team.",
      "Facilitated, as well as participated in, design sprints and lightening decision jams to help the team ideate.",
      "Created a self-service automation tool for assesing a webpage's performance, accessibilty and generating screenshots of the page for multiple view ports.",
      "Built web-ready animations, onboarding experiences, faster sites in newer frameworks and chat bots."
    ],
    "tags": "User Experience, Rapid Prototyping, JS, ReactJS, Redux, GatsbyJS, GraphQL, Adobe Suite, Sketch, Invision",
    "url": "https://www.americanexpress.com"
  },
  {
    "role": "Graduate UX Designer",
    "company": "American Express",
    "location": "Burgess Hill",
    "date": "2019",
    "desc": "Making it easier than ever to ‘refer a friend’.",
    "longDesc": [
      "Completed research into how we could improve elements of the referral hub. This included competitor analysis, analysis of existing site, creation of personas, wireframes and mockups.",
      "Worked on a proof of concept for a research archive that intelligently links and prioritises research for better design decisions. "
    ],
    "tags": "User Experience, Customer Research, User Testing, JS, ReactJS, GatsbyJS, Sketch, Invision",
    "url": "https://www.americanexpress.com"
  },
  {
    "role": "Graduate Front-End Engineer",
    "company": "American Express",
    "location": "Burgess Hill",
    "date": "2018 - 2019",
    "desc": "Working in loyalty on a UI for testing API integrations.",
    "longDesc": [
      "Designed, implemented and deployed the first version of the Loyalty Servicing Platform. A tool built to replace Oracle Forms which was running out of extended support as it was reaching end of life.",
      " Harnessed the new design language system and a modular structure that allowed us to better integrate the tool with other parts of the company."
    ],
    "tags": "Internal Tooling, Analytics, JS, ReactJS, Redux, Sketch",
    "url": "https://www.americanexpress.com"
  },
  {
    "role": "Co-Founder",
    "company": "AMNiiS",
    "location": "Remote",
    "date": "2017 - 2019",
    "desc": "Built the TrailBee application, a dedicated transport administration tool. ",
    "longDesc": [
      "Built the TrailBee application, a dedicated transport administration tool. The application consisted of a parent app and an admin user interface for schools.",
      "Created a design language system for the application that was adopted for both desktop and mobile experiences."
    ],
    "tags": "React, React Native, JS, SocketIO, Node, MongoDB, Sketch"
  },
  {
    "role": "Summer Intern",
    "company": "American Express",
    "location": "Burgess Hill",
    "date": "2017",
    "desc": "Working in loyalty on a response time monitoring tool using the ELK",
    "longDesc": [
      "Worked within an agile team delivering an internal data visualisation tool.",
      "Strengthened my competence of the Elastic Stack and Java."
    ],
    "tags": "Data Visualisations, Analytics, Logging, ELK stack, Java, Splunk",
    "url": "https://www.americanexpress.com"
  }
]
