[
  {
    "role": "UX Engineer",
    "company": "American Express",
    "location": "London",
    "date": "2019 - Present",
    "desc": "Currently creating the future of the ‘refer a friend’ experience.",
    "longDesc": [
      "Developed a new referral experience that features enhanced referral rewards for platinum and gold card members. It has engaged with 600,000 customers to date.",
      "Created a self-service automation tool for assesing a webpage's performance, accessibilty and generating screenshots of the page for multiple view ports. This has increased the ability for markets to self service, reducing the need to engage engineers to acquire this information.",
      "Facilitated design sprints and lightening decision jams to help the team ideate.",
      "Built web-ready animations, onboarding experiences, faster sites in newer frameworks and chat bots."
    ],
    "tags": "User Experience, Rapid Prototyping, JS, Typescript, ReactJS, Redux, GatsbyJS, GraphQL, Node, Express, Electron, Adobe Suite, Sketch, Invision",
    "url": "https://www.americanexpress.com"
  },
  {
    "role": "Graduate UX Designer",
    "company": "American Express",
    "location": "Burgess Hill",
    "date": "2019",
    "desc": "Making it easier than ever to ‘refer a friend’.",
    "longDesc": [
      "Conducted research into how we could improve elements of the referral hub. This included competitor analysis, analysis of existing site, creation of personas, wireframes and mockups.",
      "Built a prototype for a research archive that summarises, tags, intelligently links and prioritises research for better design decisions.",
      "Was the only graduate in my cohort to formally manage interns and have gone on to be the youngest engineer to manage graduates"
    ],
    "tags": "User Experience, User Research, User Testing, JS, ReactJS, GatsbyJS, GraphQL, Sketch, Invision, Python",
    "url": "https://www.americanexpress.com"
  },
  {
    "role": "Graduate Front-End Engineer",
    "company": "American Express",
    "location": "Burgess Hill",
    "date": "2018 - 2019",
    "desc": "Working in loyalty on a UI for testing API integrations.",
    "longDesc": [
      "Designed and built GRAD, a hub for technology onboarding. The collection initially intended for graduates, is being used campus-wide and receives over 250 unique vistors a month and has accumulated over 20,000 views.",
      "Replaced uses of Oracle forms (legacy software) in Loyalty. By doing so we no longer need to pay for extended support reducing development costs by half."
    ],
    "tags": "Internal Tooling, Analytics, JS, ReactJS, Redux, Node, Sketch, Java",
    "url": "https://www.americanexpress.com"
  },
  {
    "role": "Co-Founder",
    "company": "AMNiiS",
    "location": "Remote",
    "date": "2017 - 2019",
    "desc": "Built the TrailBee application, a dedicated transport administration tool. ",
    "longDesc": [
      "Designed & built the TrailBee application, a dedicated school transport administration tool. The application consisted of a parent app and an admin user interface for schools.",
      "Created a design language system for the application that was adopted for both desktop and mobile experiences."
    ],
    "tags": "React, React Native, JS, SocketIO, Node, MongoDB, Sketch"
  },
  {
    "role": "Summer Intern",
    "company": "American Express",
    "location": "Burgess Hill",
    "date": "2017",
    "desc": "Working in loyalty on a response time monitoring tool using the ELK",
    "longDesc": [
      "Delivered an internal data visualisation tool capable of mapping the end-to-end journey of Amazon 'Pay with Points' requests. The project alerts when our E2E time drops below expected levels to help identify issues and avoid fines from Amazon."
    ],
    "tags": "Data Visualisations, Analytics, Logging, ELK stack, Java, Splunk",
    "url": "https://www.americanexpress.com"
  }
]
